<html><head><title>Aide</title></head>
<body>
<div>
<p><h3><font color="#006600"><u>Description de l'application :</u></font></h3></p>
<h4>
Dans ce qui suit, nous allons pr&eacute;senter notre application en montrant les diff&eacute;rents fonctionnement qui sont con&ccedil;ues de mani&egrave;re 
&agrave; &ecirc;tre simples,naturelles, et pour aboutir &agrave; une compr&eacute;hension et utilisation facile.
</h4>

</div>

<p><h3><font color="#006600"><u>Interface principale :</u></font></h3></p>
<h4>
Le lancement de l'application g&eacute;n&egrave;re une premi&egrave;re interface principale qui offre &agrave; l'utilisateur les fonctionnalit&eacute;s qui 
lui facilite l'utilisation de l'application pour repr&eacute;sent&eacute; un  graphe.
L'interface illustr&eacute;e par la figure ci-dessous repr&eacute;sente l'interface principale de notre application :
</h4>
<p><img src="principale.png" height="400" width="800" alt="no fen" /></p>
<p>
<h4>
<p>La barre de menu  permet &agrave; l'utilisateur de choisir plusieurs fonctionnalit&eacute;s selon ses besoins.
La premi&egrave;re barre contient les fonctionnalit&eacute;s Fichier et Modifier et l'aide. </p>
<p>La premi&egrave;re lui permet de cr&eacute;e un nouveau projet ou d'ouvrir un projet et l'enregistrement ou quitter l'application,
 pour &lt;Modifier&gt; lui permet d'ajouter  ou de supprimer des composantes dans le graphe.</p>
</p>
</h4>
<h4>
<p>La deuxi&egrave;me barre contient les raccourcis pour les fonctionnalit&eacute;s quand vient de d&eacute;crire notre graphe  ce la est illustr&eacute; dans 
la figure qui suit : (Nouveau,ouvrir,sauvegarder, sortir)  
<img src="raccourci.png" height="70" width="300" alt="no fen" />
</p>
</h4>

<h4>
<p>
Lorsque vous cliquez sur Nouveau, une autre fenetre apparaisse, c'est une fenetre pour manipuler 
la surface de dessin et p&eacute;rciser le type de graphe (orient&eacute; ou non)  comme le montre 
<img src="nouveau.png" height="300" width="700" alt="no fen" />
</p>

</h4>
<h4>
<p>
La meme barre contient les outilles de dessin pour obtenir notre graphe comme tracer les sommets, 
les arcs et pour supprimer ou modifier comme le montre la figure.
<img src="modifier.jpg" height="300" width="800" alt="no fen" />
</p>
<p>
Comment ajouter un sommet ?
D'abord, Vous cliquez sur le bouton d'ajout d'un sommet puis vous cliquez sur l'interface de dessin dans l'endroit ou vous voulez.
</p>
</h4>
<h4>
<p>
Comment deplacez un sommet ?
Vous posez le curseur de la souris sur le sommet que vous voulez puis vous glissez en maintenant le bouton droit  enfonce.
</p>
</h4>
<h4>
<p>
Comment supprimer un sommet ?
Tout simplement cliquez sur le bouton de suppression d'un sommet puis vous cliquez sur le sommet que vous voulez supprimer.
</p>
</h4>

<h4>
<p>
Comment modifier un sommet ?
Cliquer sur modifier sommet puis sur le  sommet que vous voulez modifier et faire entrer un nouveau  nom de sommet .
</p>
</h4>

<h4>
<p>
Comment dessiner un arc ?
D'abord, vous cliquez sur le bouton d'ajout d'un arc et vous selectionne deux sommet (en cas d'un graphe orienter le 1er  sommet selectionne sera le debut de l'arc et le 2eme sera la fin de l'arc). 
</p>
</h4>
<h4>
<p>
Comment supprimer un arc ?
Par un simple processus identique a l'ajout d'un arc sauf vous cliquez sur bouton de suppression d'un arc puis vous indiquez les deux sommets de l'arc que vous voulez supprimer 
</p>
</h4>

<h4>
<p>
Comment modifier la valeur d'un arc ?
cliquez sur Modifier arc , puis selectionner le debut et la fin de l'arc puis entrer la valeur
voulu en selectionnant l'arc voulu.
</p>
</h4>

<h4>
<p>
<p><u>Remarque :</u></p>
<p>
tous les processus de manipulation des composantes du graphe(sommet, arc)  en cas orient&eacute; sont disponible en cas non orient&eacute; .

Et bien sure vous pouvez avoir les matrices (matrice  d'adjacence , d'incidence et de valuation ) pour avoir une representation du graphe sous forme de matrices.

Vous pouvez voir &agrave; droite de l'application quelque information sur les sommets, les successeurs d'un sommet, listes Arc(Arete).  
Et en bas de dessin vous pouvez lancer l'ex&eacute;cution (trouver plus court chemin) en commencant par le choix d'algorithme  puis le sommet de d&eacute;part et point d'arriv&eacute;e.

</p>
</h4>
<h4>
<p>

</p>
</h4>

</body>
</html>

